0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1 0);

boundaryField
{
    inlet
    {
        type            	flowRateInletVelocity;
        volumetricFlowRate 	constant 0.070;
        value           	uniform (0 0 0);
    }

    outlet1
    {
        type        inletOutlet;
    	inletValue  uniform (0 0 0);
    	value       uniform (0 0 0);
    }

    outlet2
    {
        type    pressureInletOutletVelocity;
        value   uniform (0 0 0);
    }

    outlet3
    {
        type        inletOutlet;
    	inletValue  uniform (0 0 0);
    	value       uniform (0 0 0);
    }

    wallLeakOutlet32
    {
        type    noSlip;
    }

    leakOutlet32
    {
        type        inletOutlet;
    	inletValue  uniform (0 0 0);
    	value       uniform (0 0 0);
    }
}
