0/magU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      magU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet1
    {
        type            calculated;
        value           uniform 0;
    }
    outlet2
    {
        type            calculated;
        value           uniform 0;
    }
    outlet3
    {
        type            calculated;
        value           uniform 0;
    }
    wallLeakOutlet32
    {
        type            calculated;
        value           uniform 0;
    }
    leakOutlet32
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
