0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type zeroGradient;
    }

    outlet1
    {
    	type zeroGradient;
    }

    outlet2
    {
    	type fixedValue;
    	value uniform 0;
    }

    outlet3
    {
    	type zeroGradient;
    }

    wallLeakOutlet32
    {
        type zeroGradient;
    }

    leakOutlet32
    {
        type zeroGradient;
    }
}
