constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

// dynamic viscosity of air or water depending on use
nu              nu [0 2 -1 0 0 0 0] 1e-6;

// ************************************************************************* //
