system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Dimensions of the main pipe
convertToMeters 1;

vertices
(
    (-1.1 -0.1 -1.1)   
    (1.5 -0.1 -1.1)     
    (1.5 4.1 -1.1)     
    (-1.1 4.1 -1.1)    
    (-1.1 -0.1 1.1)    
    (1.5 -0.1 1.1)   
    (1.5 4.1 1.1)       
    (-1.1 4.1 1.1)       
);




blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet1
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet2
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    outlet3
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
