system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver 		PCG;
        preconditioner 	DIC;
        tolerance 	1e-8;
        relTol 		0.0;
    }

    U
    {
        solver 		smoothSolver;
        smoother 	GaussSeidel;
        tolerance 	1e-7;
        relTol 		0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent yes;

    pRefCell 	0;
    pRefValue 	0;

    residualControl
    {
        p   1e-6;
        U   1e-7;
    }


}

relaxationFactors
{
    fields
    {
	p	0.2;
    }

    equations
    {
        U 0.2;

    }
}

